from OpenRA_Copilot_Library.game_api import GameAPI

# init game api
game_api = GameAPI(host="localhost", port=7445, language="zh")

BUILDING = ["发电厂", "兵营", "矿场", "坦克工厂", "雷达站", "维修厂", "储存罐", "核电站", "空军基地", "科技中心", "军犬窝", "火焰塔", "特斯拉塔", "防空导弹", "铁幕装置", "核弹发射井", "建造厂", "油井"]
INFANTRIES = ["步兵", "火箭兵", "工程师", "掷弹兵", "军犬", "喷火兵", "间谍", "磁暴步兵"]
VEHICLE = ["采矿车", "装甲运输车", "防空车", "基地车", "轻坦克", "吉普车", "重型坦克", "V2火箭发射车", "地雷部署车", "超重型坦克", "特斯拉坦克", "震荡坦克", "运输卡车"]
AIR = ["运输直升机", "雌鹿直升机", "黑鹰直升机", "雅克战机", "长弓武装直升机", "米格战机"]

BUILDING_DEPENDENCIES = {
    "电厂": ["部署后的基地车"],
    "兵营": ["电厂"],
    "矿场": ["电厂"],
    "坦克工厂": ["矿场"],
    "雷达": ["矿场"],
    "维修厂": ["坦克工厂"],
    "核电站": ["雷达"],
    "科技中心": ["坦克工厂", "雷达"],
    "空军基地": ["雷达"]
}

UNIT_DEPENDENCIES = {
    "步兵": ["兵营"],
    "火箭兵": ["兵营"],
    "工程师": ["兵营"],
    "掷弹兵": ["兵营"],
    "采矿车": ["坦克工厂"],
    "防空车": ["坦克工厂"],
    "装甲车": ["坦克工厂"],
    "重坦": ["坦克工厂", "维修厂"],
    "V2火箭发射车": ["坦克工厂", "雷达"],
    "超重型坦克": ["坦克工厂", "维修厂", "科技中心"]
}
